** misc configuration, etc., stuff                                 :noexport:
#+title: A small confirmation of some fairly well-known facts regarding the distribution of (household) incomes in the US
#+property: header-args :noweb yes
#+property: header-args:R :session ss
#+HTML_DOCTYPE: html5
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:t
#+OPTIONS: toc:nil
#+html_head_extra: <link href="lib/kbstyle.css" rel="stylesheet"/>
to change how the result is "wrapped", customize the variable
org-babel-inline-result-wrap.  the following means that the results of
inline calls are "raw".
#+bind: org-babel-inline-result-wrap "%s"

# our canonical file name...
#+name: ifile
#+BEGIN_SRC sh :cache yes
make binned
#+END_SRC

#+RESULTS[f43f76bafeb827b627f0a9cc98f177c4a94a9594]: ifile :cache yes
: ./ipums/cps_00006.1962-2017-binned.csv

# our years
#+name: years
#+BEGIN_SRC sh :cache yes :results verbatim
(make fyear; make lyear) | tr '\n' ',' | sed 's/,$//'
#+END_SRC

#+RESULTS[fea825c4ca5c095b74fa62be088b072ae715f74b]: years
: 1972,2016

*** Who gets what percent of the national income?

A lot of money is paid out in income in the United States.  How is
this money, the total household income (the total of the amounts of
money reported as household income, henceforth, "total income"
[fn::I.e., the sum of the product of each of the amount reported as a
household income times the number of households reporting that
amount]) distributed among the various income groups?  Here is a CDF
which shows what percent of the total national income is paid out to
which income groups in the US.

First we show, in a table form, how much of the total income was
earned by different percentiles of households in the United States,
for the years 1972 and 2016.  We see that, for example, in 1972,
call_lucr(keys=0.5,tgtinkey="%totalincome:%population",years=1972,docomprss="FALSE")
of the total US income was earned by the less wealthy half of US
households (by income), whereas, in 2016, the less wealthy half of US
households earned only
call_lucr(keys=0.1,tgtinkey="%totalincome:%population",years=2016,docomprss="FALSE")
of the total US income.


#+name: tincdistrbytile
#+begin_src R :results table :colnames yes :exports results
  <<create.tiles>>
  df <- tiles.main(c("--maxhh", "2e14", "--tgt.in.key", "%totalincome:%population", "--tiles", ".1,.25,.5,.75,.9,1", "--diff"))
  round(df,4)
#+end_src

#+RESULTS: tincdistrbytile
| Year |    0.1 |   0.25 |    0.5 |   0.75 |    0.9 |      1 |
|------+--------+--------+--------+--------+--------+--------|
| 1972 | 0.0169 | 0.0598 | 0.1786 | 0.2733 | 0.2213 | 0.2501 |
| 2016 | 0.0089 |  0.044 | 0.1358 | 0.2468 |   0.24 | 0.3245 |

Here we notice that the top ten percent of income earners (from 0.9
to 1) has increased its share of the total US household income from 25
percent in 1972 to almost 33 percent in 2016 while, at the same time,
the bottom ten percent (from 0 to 0.1) has seen *its* share of the
total income decrease by about one half.  This is to the point I
understood to be Blom's question, i.e, even *if* the *share* of the
bottom income bracket fell, do we really care, assuming (which turns
out to be an untrue assumption) that the *actual* household income of
that bottom income bracket in fact increased.

Now we look at the same data, however looking at the total income
earned by each household income bracket.

#+name: tincdistrbybracket
#+BEGIN_SRC sh :tangle bin/create.tincdistrbybracket :shebang "#!/bin/sh" :results none :exports none :eval never :var years=years
  ./bin/create.ecdf.common $* --years ${years} --tgt.in.key %totalincome:bracket --maxhh 220000
#+END_SRC

#+caption: How the total US income in 1972 and in 2016 was distributed across US households (sorted by income)
[[file:graphs/tincdistrbybracket.IMG]]

*** Where have all the flowers gone

#+name: comprss
#+BEGIN_SRC R :exports none :eval no-export
  ## https://stackoverflow.com/a/28160474
  comprss <- function(number, words=FALSE, precision=2) {
      "output a (presumably) large NUMBER with trailing units, at a specified PRECISION"
      if (words) {
          units <- c("", "thousand", "million", "billion", "trillion")
      } else {
          units <- c("","K","M","B","T")
      }
      div <- findInterval(abs(as.numeric(gsub("\\,", "", number))),
                          c(1, 1e3, 1e6, 1e9, 1e12))

      div[div==0] <- 1
      paste(round(as.numeric(gsub("\\,","",number))/10^(3*(div-1)),
                  precision),
            units[div])
  }
#+END_SRC

#+name: doprint
#+begin_src R :exports none :eval no-export
  <<comprss>>
  doprint <- function(vals, words=words, docomprss, format, diff, round) {
      if (diff && (length(vals)>1)) {
          vals <- diff(vals)
      }
      if (round) {
          vals <- round(vals, round)
      }
      if (docomprss) {
          vals <- comprss(vals, words=words)
      } else {
          if (format == "") {
              format <- NULL
          }
          ## Sys.localeconv()["thousands_sep"] == "" for some reason, so...
          vals <- prettyNum(vals, big.mark=" ", format=format)
      }
      sprintf("%s", vals)
  }
#+end_src

#+RESULTS: doprint

#+name: lucr
#+BEGIN_SRC R :exports none :var tgtinkey="totalincome:%population" :var keys="1" :var years="1972,2016" :var ifile=ifile :var words="FALSE" :var docomprss="TRUE" :var format="" :var diff=1 :var round=3
  <<lookup>>
  <<doprint>>

  df <- lookup.main(c("--ifile", ifile, "--maxhh", "2e14", "--years", years, "--tgt.in.key", tgtinkey, "--keys", keys))
  doprint(df[,3], words=words, docomprss=docomprss, format=format, diff=diff, round=round)
#+END_SRC

#+RESULTS: lucr
: 10.17 T

The total household income of the United States (the total of the
amounts of money reported as household income, henceforth, "total
income" [fn::I.e., the sum of the product of each of the amount
reported as a household income times the number of households
reporting that amount]) increased from
call_lucr(keys=1,years=1972,words="TRUE",docomprss="TRUE") dollars in
1972 to call_lucr(keys=1,years=2016,words="TRUE",docomprss="TRUE") in
2016, an increase of call_lucr(keys=1,years="1972,2016",words="TRUE")
dollars.  Who got all this money?  How was it shared among the
population?

The following graphic shows how the extra money earned in 2016 (over
that earned in 1972) has been shared among the income deciles in the US.

#+BEGIN_SRC sh :tangle bin/create.tidistr :shebang "#!/bin/sh" :results none :eval never :exports none
  ./bin/create.ecdf.common $* --years 1972,2016 --tgt.in.key %totalincome:%population --delta --maxhh 2e14
#+END_SRC

#+caption: How the increase in incomes of US households in 2016 over 1972 was distributed across deciles of the US popuation (sorted by income)
[[file:graphs/tidistr.IMG]]

While the above graphic may look to be the graph of a cumulative
distribution, it is not (it looks like a CDF because, well, "the rich
get richer").  It is, rather, the actual distribution, showing how
much of the excess income between 1972 and 2016 is earned by each of
the ten decile income groups in the US.  If the extra income had been
shared equally across the ten income groups, the ten bars would all
have the same height.  Instead, we see that the highest decile (the
highest ten percent of earners) has captured more than 35 percent of
the increased income, while the lowest ten percent has captured
effectively nothing of the increase in income over the previous 40+
years.

Note that this chart shows that within *all* (other than maybe the
lowest income decile) income deciles, there was more total income
received by that group in 2016 than in 1972.  This might seem to
contradict the main point of this note, i.e., that a large number of
lower income households in fact were in fact worse off in 2016 than
they were in 1972.  (And, of course, our methodology doesn't let us
look at, e.g., the Smith family from 1972 Main Street, and see how
their fortunes changed over the span of years.)  But, the reason for
the increase in *total* income being positive, whereas the income per
family is *negative* is that, in 2016 there were more families than in
1972, as the US population grew about 50 percent over that time
period.  So, the total income for a given group may have grown,
without the income per family growing.  [fn:1:The bars in the above
graph are *still* reflective of the overall inequality, as the number
of households in each income decile are the same.]

**** [[https://www2.census.gov/programs-surveys/cps/tables/time-series/historical-income-households/h01ar.xls][Census Bureau]] has something that breaks down by each fifth and top 5%.

#+BEGIN_SRC R :var tseries=tseries :eval no-export :exports none
colnames(tseries) <- c("year", "number", "lowest", "second", "third", "fourth", "llimittop5")
#+END_SRC

#+RESULTS:
| year       |
| number     |
| lowest     |
| second     |
| third      |
| fourth     |
| llimittop5 |

however, the FT graph Blom showed has about fifty buckets, whereas the
Census data seems to have have six.

#+name: tseries
#+BEGIN_SRC sh :eval no-export :exports none
  xls2csv census/h01ar.xls |
      awk '/2016 Dollars/ { ok = 1; next} \
          /^"[12]/ {
                   if (ok) { 
                      gsub(/ *\([0-9][0-9]\) */, ""); 
                      gsub(/"/, ""); 
                      print;
                    }}' 2>&1 |
      tac
#+END_SRC

#+RESULTS: tseries
| 1967 |  60813 | 18856 | 36768 | 52186 |  74417 | 119419 |
| 1968 |  62214 | 20098 | 38103 | 54614 |  76737 | 120053 |
| 1969 |  63401 | 20699 | 39718 | 57441 |  80478 | 126218 |
| 1970 |  64778 | 20350 | 38985 | 56703 |  80899 | 127880 |
| 1971 |  66676 | 20088 | 38294 | 56353 |  80353 | 127602 |
| 1972 |  68251 | 20786 | 40033 | 59167 |  84686 | 136292 |
| 1973 |  69859 | 21238 | 40839 | 60425 |  87000 | 139832 |
| 1974 |  71163 | 21340 | 39585 | 58493 |  84892 | 134366 |
| 1975 |  72867 | 20288 | 38076 | 57536 |  82611 | 130365 |
| 1976 |  74142 | 20738 | 38636 | 58856 |  84678 | 134287 |
| 1977 |  76030 | 20694 | 38977 | 59411 |  86616 | 137142 |
| 1978 |  77330 | 21338 | 40346 | 61046 |  88785 | 142036 |
| 1979 |  80776 | 21594 | 40103 | 61700 |  89461 | 144557 |
| 1980 |  82368 | 20745 | 38905 | 59645 |  87332 | 140543 |
| 1981 |  83527 | 20340 | 38023 | 58809 |  86946 | 139925 |
| 1982 |  83918 | 20080 | 38191 | 58352 |  87015 | 143636 |
| 1983 |  85290 | 20516 | 38149 | 58550 |  88485 | 145579 |
| 1984 |  86789 | 20909 | 39134 | 60292 |  91077 | 150768 |
| 1985 |  88458 | 21154 | 39801 | 61657 |  92731 | 153220 |
| 1986 |  89479 | 21430 | 40990 | 63616 |  96164 | 161255 |
| 1987 |  91124 | 21835 | 41447 | 64697 |  97780 | 163619 |
| 1988 |  92830 | 22210 | 41953 | 65380 |  98722 | 167109 |
| 1989 |  93347 | 22614 | 43000 | 66089 | 100414 | 171533 |
| 1990 |  94312 | 22271 | 42159 | 64498 |  98359 | 168813 |
| 1991 |  95669 | 21646 | 41260 | 63729 |  97578 | 165727 |
| 1992 |  96426 | 21136 | 40494 | 63575 |  97304 | 166101 |
| 1993 |  97107 | 21217 | 40380 | 63473 |  98663 | 171210 |
| 1994 |  98990 | 21518 | 40389 | 64269 | 100717 | 176013 |
| 1995 |  99627 | 22536 | 42121 | 65734 | 101921 | 176848 |
| 1996 | 101018 | 22513 | 42318 | 67084 | 103684 | 182230 |
| 1997 | 102528 | 22979 | 43571 | 68640 | 106690 | 188834 |
| 1998 | 103874 | 23727 | 44768 | 71163 | 110418 | 194628 |
| 1999 | 106434 | 24702 | 46014 | 72630 | 114216 | 204698 |
| 2000 | 108209 | 24985 | 46009 | 72742 | 114000 | 202470 |
| 2001 | 109297 | 24361 | 45162 | 71849 | 113195 | 204021 |
| 2002 | 111278 | 23911 | 44545 | 70950 | 112127 | 200192 |
| 2003 | 112000 | 23468 | 44369 | 71059 | 113358 | 201120 |
| 2004 | 113343 | 23489 | 44059 | 70177 | 111818 | 199682 |
| 2005 | 114384 | 23570 | 44244 | 70864 | 112705 | 204014 |
| 2006 | 116011 | 23850 | 44967 | 71425 | 115508 | 207146 |
| 2007 | 116783 | 23489 | 45262 | 71770 | 115758 | 204892 |
| 2008 | 117181 | 23089 | 43476 | 69924 | 111744 | 200658 |
| 2009 | 117538 | 22880 | 43124 | 69134 | 111865 | 201359 |
| 2010 | 119927 | 22017 | 41832 | 67702 | 110116 | 198686 |
| 2011 | 121084 | 21617 | 41096 | 66609 | 108375 | 198438 |
| 2012 | 122459 | 21533 | 41568 | 67511 | 108818 | 199827 |
| 2013 | 122952 | 21535 | 41408 | 67492 | 109129 | 201957 |
| 2013 | 123931 | 21638 | 42282 | 69242 | 113582 | 211362 |
| 2014 | 124587 | 21728 | 41754 | 69153 | 113811 | 209419 |
| 2015 | 125819 | 23088 | 44061 | 72911 | 118480 | 217172 |
| 2016 | 126224 | 24002 | 45600 | 74869 | 121018 | 225251 |

**** topcodes

ipums [[https://cps.ipums.org/cps-action/variables/HHINCOME#codes_section][HHINCOME]] uses "[[https://cps.ipums.org/cps/inctaxcodes.shtml][topcodes]]" (and bottom codes) to encode
exceptions.  the popular "99999999" means "Not in universe" (NIU) --
something about the respondent

#+name: foundtopcodes
#+BEGIN_SRC sh :eval no-export :exports none
  zcat ipums/cps_00006.csv.gz | \
      awk 'BEGIN{FS=","} {print $7}' | \
      grep '\<9999' | \
      words -f | \
      sort -n
#+END_SRC

#+RESULTS: topcodes
| -9999997 |  129 |
|    -9999 |  781 |
|     9999 |  194 |
|    99990 |   12 |
|    99991 |    4 |
|    99992 |    8 |
|    99994 |    9 |
|    99995 |    8 |
|    99996 |   16 |
|    99997 |   14 |
|    99998 |   12 |
|    99999 |  525 |
| 99999999 | 2704 |

between the two web sites above, and the topcodes list above, maybe
these are the topcodes
|----------+-------------|
| 99999999 | N.I.U.      |
| -9999997 | Bottom Code |

#+name: topcodealpha
#+begin_src R :exports none :results none :eval none
  tcodeprep <- function() {
      x <- t(matrix(list(99999999, "N.I.U.",                     # (Not in Universe)
                         -9999997, "< -$9999"),
                    nrow=2))
      y <- as.data.frame(x)
      colnames(y) <- c("value", "nomen")
      y$value <- unlist(y$value)
      y$nomen <- unlist(y$nomen)
      return(y)
  }

  topcodes <- tcodeprep()                 # make available globally

  topcodealpha <- function(vals) {
      "convert top (or bottom) codes in vals to some
  identifying character string"
      z <- match(vals, topcodes$value)
      vals[!is.na(z)] <- topcodes[z[!is.na(z)],]$nomen
      vals
  }
#+end_src

*** performance tuning bincps

the original version of this code processed each (non-trivial) year in
about 5 minutes on my system.  this turned out to be due to my habit,
motivated by trying to save main store usage, of not creating
subsetted copies of the massive dataset 'dset', but rather just using
"filters".  code such as:
:       sna <- sy & snabit
and then accessing 'dset' via the filter
: if (nrow(yset[sna,]) != 0)

so, i modified the code to create a new dataset, 'yset', for each
year, then use filters to access inside that dataset while processing
that year's data.  this got the time to process a year's worth of data
to fall to 5-20 seconds.

i became curious to know how these numbers related to the number of
observations in each year.  here we use awk(1) to count how many
observations are used in each year.

#+name: yearpeople
#+BEGIN_SRC sh :cache yes :eval no-export :exports none
  zcat ipums/cps_00006.csv.gz |
      awk 'BEGIN { FS="," } /^[12]/ { print $1}' |
      words -f                    # words returns each word seen, along
                                  # with the number of times that word
                                  # was seen (the "-f", "frequency",
                                  # flag)
#+END_SRC

#+RESULTS[ea0344ff23fa76aad213c3cc0bd2cc671e5f2113]: yearpeople
| 1962 |  71741 |
| 1963 |  55882 |
| 1964 |  54543 |
| 1965 |  54502 |
| 1966 | 110055 |
| 1967 |  68676 |
| 1968 | 150913 |
| 1969 | 151848 |
| 1970 | 145023 |
| 1971 | 146822 |
| 1972 | 140432 |
| 1973 | 136221 |
| 1974 | 133282 |
| 1975 | 130124 |
| 1976 | 135351 |
| 1977 | 160799 |
| 1978 | 155706 |
| 1979 | 154593 |
| 1980 | 181488 |
| 1981 | 181358 |
| 1982 | 162703 |
| 1983 | 162635 |
| 1984 | 161167 |
| 1985 | 161362 |
| 1986 | 157661 |
| 1987 | 155468 |
| 1988 | 155980 |
| 1989 | 144687 |
| 1990 | 158079 |
| 1991 | 158477 |
| 1992 | 155796 |
| 1993 | 155197 |
| 1994 | 150943 |
| 1995 | 149642 |
| 1996 | 130476 |
| 1997 | 131854 |
| 1998 | 131617 |
| 1999 | 132324 |
| 2000 | 133710 |
| 2001 | 218269 |
| 2002 | 217219 |
| 2003 | 216424 |
| 2004 | 213241 |
| 2005 | 210648 |
| 2006 | 208562 |
| 2007 | 206639 |
| 2008 | 206404 |
| 2009 | 207921 |
| 2010 | 209802 |
| 2011 | 204983 |
| 2012 | 201398 |
| 2013 | 202634 |
| 2014 | 199556 |
| 2015 | 199024 |
| 2016 | 185487 |
| 2017 | 185914 |

  

this is from a run
: bincps1(ifile=ifile, dset, ofile=ofile, rfile=rfile, ofsep=ofsep, fyear=fyear, lyear=lyear, min1999=min1999, max1999=max1999);

#+name: yeartimes
| 1962 | Thu Nov 30 17:46:18 2017 |
| 1963 | Thu Nov 30 17:46:18 2017 |
| 1964 | Thu Nov 30 17:46:19 2017 |
| 1965 | Thu Nov 30 17:46:19 2017 |
| 1966 | Thu Nov 30 17:46:19 2017 |
| 1967 | Thu Nov 30 17:46:20 2017 |
| 1968 | Thu Nov 30 17:46:21 2017 |
| 1969 | Thu Nov 30 17:46:26 2017 |
| 1970 | Thu Nov 30 17:46:31 2017 |
| 1971 | Thu Nov 30 17:46:36 2017 |
| 1972 | Thu Nov 30 17:46:41 2017 |
| 1973 | Thu Nov 30 17:46:45 2017 |
| 1974 | Thu Nov 30 17:46:49 2017 |
| 1975 | Thu Nov 30 17:46:53 2017 |
| 1976 | Thu Nov 30 17:46:57 2017 |
| 1977 | Thu Nov 30 17:47:02 2017 |
| 1978 | Thu Nov 30 17:47:09 2017 |
| 1979 | Thu Nov 30 17:47:15 2017 |
| 1980 | Thu Nov 30 17:47:22 2017 |
| 1981 | Thu Nov 30 17:47:29 2017 |
| 1982 | Thu Nov 30 17:47:35 2017 |
| 1983 | Thu Nov 30 17:47:42 2017 |
| 1984 | Thu Nov 30 17:47:48 2017 |
| 1985 | Thu Nov 30 17:47:54 2017 |
| 1986 | Thu Nov 30 17:48:02 2017 |
| 1987 | Thu Nov 30 17:48:09 2017 |
| 1988 | Thu Nov 30 17:48:15 2017 |
| 1989 | Thu Nov 30 17:48:22 2017 |
| 1990 | Thu Nov 30 17:48:29 2017 |
| 1991 | Thu Nov 30 17:48:36 2017 |
| 1992 | Thu Nov 30 17:48:43 2017 |
| 1993 | Thu Nov 30 17:48:49 2017 |
| 1994 | Thu Nov 30 17:48:56 2017 |
| 1995 | Thu Nov 30 17:49:02 2017 |
| 1996 | Thu Nov 30 17:49:09 2017 |
| 1997 | Thu Nov 30 17:49:17 2017 |
| 1998 | Thu Nov 30 17:49:24 2017 |
| 1999 | Thu Nov 30 17:49:32 2017 |
| 2000 | Thu Nov 30 17:49:41 2017 |
| 2001 | Thu Nov 30 17:49:48 2017 |
| 2002 | Thu Nov 30 17:50:02 2017 |
| 2003 | Thu Nov 30 17:50:16 2017 |
| 2004 | Thu Nov 30 17:50:31 2017 |
| 2005 | Thu Nov 30 17:50:46 2017 |
| 2006 | Thu Nov 30 17:51:00 2017 |
| 2007 | Thu Nov 30 17:51:15 2017 |
| 2008 | Thu Nov 30 17:51:30 2017 |
| 2009 | Thu Nov 30 17:51:43 2017 |
| 2010 | Thu Nov 30 17:51:56 2017 |
| 2011 | Thu Nov 30 17:52:10 2017 |
| 2012 | Thu Nov 30 17:52:24 2017 |
| 2013 | Thu Nov 30 17:52:39 2017 |
| 2014 | Thu Nov 30 17:52:54 2017 |
| 2015 | Thu Nov 30 17:53:16 2017 |
| 2016 | Thu Nov 30 17:53:31 2017 |
| 2017 | Thu Nov 30 17:53:46 2017 |

then, we use some R code to put the preceding two outputs together and
compute the number of seconds per person.

#+name: peoplepersecond
#+BEGIN_SRC R :var yeartimes=yeartimes :var yearpeople=yearpeople :eval no-export :exports none
  rownames(yearpeople) <- yearpeople[,1]
  colnames(yearpeople) <- c("pyear", "people")
  rownames(yeartimes) <- yeartimes[,1]
  colnames(yeartimes) <- c("tyear", "stime")
  years <- cbind(yearpeople, yeartimes)
  years <- cbind(years, time=as.POSIXct(years$stime, format="%a %b %d %H:%M:%S %Y"))
  deltas <- years[1:nrow(years)-1,]$people /
    max(1, lag(as.ts(years$time))-as.ts(years$time))
  years <- cbind(years, delta=c(deltas, NA))
  cbind(year=years$tyear, perperson=years$delta)
#+END_SRC

so, the number of people processed per second is:

#+RESULTS: peoplepersecond
| 1962 | 3260.95454545455 |
| 1963 | 2540.09090909091 |
| 1964 | 2479.22727272727 |
| 1965 | 2477.36363636364 |
| 1966 |           5002.5 |
| 1967 | 3121.63636363636 |
| 1968 | 6859.68181818182 |
| 1969 | 6902.18181818182 |
| 1970 | 6591.95454545455 |
| 1971 | 6673.72727272727 |
| 1972 | 6383.27272727273 |
| 1973 | 6191.86363636364 |
| 1974 | 6058.27272727273 |
| 1975 | 5914.72727272727 |
| 1976 | 6152.31818181818 |
| 1977 | 7309.04545454545 |
| 1978 | 7077.54545454545 |
| 1979 | 7026.95454545455 |
| 1980 | 8249.45454545455 |
| 1981 | 8243.54545454545 |
| 1982 | 7395.59090909091 |
| 1983 |           7392.5 |
| 1984 | 7325.77272727273 |
| 1985 | 7334.63636363636 |
| 1986 | 7166.40909090909 |
| 1987 | 7066.72727272727 |
| 1988 |             7090 |
| 1989 | 6576.68181818182 |
| 1990 | 7185.40909090909 |
| 1991 |           7203.5 |
| 1992 | 7081.63636363636 |
| 1993 | 7054.40909090909 |
| 1994 | 6861.04545454545 |
| 1995 | 6801.90909090909 |
| 1996 | 5930.72727272727 |
| 1997 | 5993.36363636364 |
| 1998 | 5982.59090909091 |
| 1999 | 6014.72727272727 |
| 2000 | 6077.72727272727 |
| 2001 | 9921.31818181818 |
| 2002 | 9873.59090909091 |
| 2003 | 9837.45454545455 |
| 2004 | 9692.77272727273 |
| 2005 | 9574.90909090909 |
| 2006 | 9480.09090909091 |
| 2007 | 9392.68181818182 |
| 2008 |             9382 |
| 2009 | 9450.95454545455 |
| 2010 | 9536.45454545455 |
| 2011 | 9317.40909090909 |
| 2012 | 9154.45454545455 |
| 2013 | 9210.63636363636 |
| 2014 | 9070.72727272727 |
| 2015 | 9046.54545454545 |
| 2016 | 8431.22727272727 |
| 2017 |              nil |

